# Pandas

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 1

In [3]:
df1 = DataFrame(np.arange(9).reshape(3, 3), index=['BJ', 'SH', 'GZ'], columns=['A', 'B', 'C'])
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

### 2

In [4]:
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [6]:
df2 = df1.copy()
df2

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [10]:
df2.index

Index(['BJ', 'SH', 'GZ'], dtype='object')

In [11]:
df2.index = Series(['bj', 'sh', 'gz'])
df2

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

### 3

In [13]:
df3 = df1.copy()
df3

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [15]:
df4 = df3.rename(index={'BJ': 'bj', 'SH': 'sh', 'GZ': 'gz'})
df4

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [16]:
df3

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [18]:
df5 = df3.rename(index=str.lower)
df5

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

### 4

In [19]:
df3

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [21]:
df6 = df3.rename(columns={'A': 'a', 'B': 'b'})
df6

    a  b  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [22]:
df7 = df3.rename(columns=str.lower)
df7

    a  b  c
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

### 5

In [23]:
df3

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [24]:
df8 = df3.rename(index={'BJ': 'beijing'}, columns=str.lower)
df8

         a  b  c
beijing  0  1  2
SH       3  4  5
GZ       6  7  8

### 6

In [25]:
df3

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [26]:
def test_map(x):
    return str(x) + '_' + 'ABC'

In [27]:
df9 = df3.rename(index=test_map)
df9

        A  B  C
BJ_ABC  0  1  2
SH_ABC  3  4  5
GZ_ABC  6  7  8